# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# development
brew "git"
brew "zsh"
brew "node"
brew "yarn"
brew "python3"
brew "rbenv"
brew "tmux"
brew "neovim"

# mac app store
brew "mas"

# applications
cask "1password"
cask "google-chrome"
cask "firefox"
cask "visual-studio-code"
cask "iterm2"
cask "postman"
cask "sequel-pro"
cask "discord"
cask "spotify"
cask "vlc"
cask "via"
cask "alfred"
cask "notion"
cask "obsidian"
# cask "logitech-options"
cask "obs"
cask "blackhole-2ch"

# fonts
cask "font-jetbrains-mono-nerd-font"

# apps from app store
mas "HP Smart for Desktop", id: 1474276998
# mas "Magnet", id: 441258766
